{"by":"whp","id":14411338,"score":1,"text":"Healthcare cost represents 17% of US GDP. That’s 3 trillion dollars! A large portion of that is costs associated with medical doctors, nurses and healthcare staff in general. The world of healthcare staffing is dominated by telephones, fax machines, and paper calendars. We’re building a future where the people who work in healthcare are better managed and are empowered to be the healers they want to be.<p>Care Revolutions is a marketplace for healthcare staff. More than 100 medical centers in California and Florida book highly specialized professionals on carerevolutions.com every day.<p>Care Revolutions is funded by an extraordinary group of investors including Y Combinator partners and alumni.<p>We are looking for an experienced Outside Sales Account Manager to join our team. Preferably someone with medical experience. We are looking for someone with strong sales experience and a good network in Ambulatory Surgery Centers.<p>What you&#x27;ll do<p>* Visit customers (Ambulatory Surgery Centers), describe Care Revolution’s value proposition, convert leads to customers by educating them on the benefits of using the Care Revolutions online platform to supplement core staff.\n* Demo software and onboard customers.\n* Work with an SDR and develop your own strategies to schedule in-person meetings with ASC Administrators and Nursing Directors.\n* Support the creation of scripts for sales calls, in-person visits, demos and onboarding process.\n* Manage relationships with existing customers, address concerns and questions, grow accounts.\n* Propose product improvements based on customer feedback.<p>Who you are:<p>You have 2 to 5 years of sales and account management experience\nMost likely you also have healthcare or medical experience.\nYou are or have been an RN or an Administrator of an Ambulatory Surgery Center<p>What success looks like: Grow revenue in your territory by 10% MoM.<p>Email founders@carerevolutions.com to start the conversation.","time":1495644165,"title":"Care Revolutions (YC S16) Is Looking for Hunters","type":"job"}